using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Eduda.Forms
{
    public partial class AboutUS : Form
    {
        public AboutUS()
        {
            InitializeComponent();
        }

        private void label2_Click(object sender, EventArgs e)
        {
            MessageBox.Show("\r\n- سياسة الخصوصية\r\n\r\nنحن في Eduda نولي أهمية كبيرة لحماية خصوصية مستخدمينا وبياناتهم الشخصية.\r\n\r\n\r\n1.حماية البيانات\r\n\r\nنلتزم باتخاذ الإجراءات اللازمة لحماية بياناتك الشخصية. نستخدم تقنيات حديثة لتأمين البيانات أثناء النقل والتخزين. يشمل ذلك التشفير وطرق الأمان الأخرى. ومع ذلك، لا يمكن ضمان الأمان الكامل على الإنترنت، لذا يجب أن تتحمل مسؤولية حماية بياناتك الخاصة عند استخدام النظام.\r\n\r\n2. مشاركة البيانات\r\n\r\nنحن لا نشارك بيانات المستخدمين مع أي أطراف ثالثة، باستثناء الحالات التالية:\r\n\r\n3. حقوق المستخدمين\r\n\r\nيحق لجميع مستخدمي النظام:\r\n\r\nالوصول إلى بياناتهم: يمكن للمستخدمين الاطلاع على البيانات المخزنة عنهم وتحديثها.\r\nتصحيح البيانات: يمكنهم طلب تصحيح أو تعديل أي معلومات غير صحيحة.\r\nحذف البيانات: يمكنهم طلب حذف بياناتهم الشخصية، مع مراعاة الالتزامات القانونية والعملية.\r\nالانسحاب من المعالجة: يمكن للمستخدمين سحب موافقتهم على معالجة بياناتهم الشخصية في أي وقت.\r\n\r\n4. التعديلات على سياسة الخصوصية\r\n\r\nقد نقوم بتعديل سياسة الخصوصية من وقت لآخر. سيتم نشر أي تغييرات على هذه الصفحة، وسيتم إشعار المستخدمين بالتغييرات المهمة.\r\n\r\n5.الاتصال بنا\r\n\r\nإذا كانت لديك أي أسئلة أو استفسارات بخصوص سياسة الخصوصية، يمكنك التواصل معنا عبر:\r\n\r\n* البريد الإلكتروني: [Ali@gmail.com]\r\n* الهاتف: [77777777] \"الرقم اليمني\"\r\n* العنوان: [اليمن, تعز, التربه]\r\n\r\n\r\n\r\n### شروط الاستخدام\r\n\r\nمن خلال استخدامك لنظام Eduda لإدارة المدرسة، فإنك توافق على الشروط التالية:\r\n\r\n1. الاستخدام المسموح به\r\n\r\nيجب على المستخدمين الالتزام باستخدام النظام لأغراض قانونية فقط. يُحظر استخدام النظام لأغراض غير قانونية أو ضارة مثل:\r\n\r\n* التلاعب أو العبث بنظام البيانات.\r\n* نشر أو مشاركة أي محتوى غير قانوني أو مسيء.\r\n* محاولة الوصول غير المصرح به إلى الأنظمة أو المعلومات.\r\n\r\n2. حقوق الملكية الفكرية\r\n\r\nيجب على المستخدمين احترام حقوق الملكية الفكرية المتعلقة بالنظام. جميع حقوق النسخ والبرمجيات والتصميمات تنتمي إلى  Eduda أو مزودي الخدمات. لا يُسمح بنسخ أو توزيع أو تعديل المحتوى دون إذن.\r\n\r\n3. المسؤولية القانونية\r\n\r\nنحن لا نتحمل المسؤولية عن أي خسائر أو أضرار قد تنجم عن استخدام النظام. أنت مسؤول عن الحفاظ على سرية بيانات الدخول الخاصة بك (مثل اسم المستخدم وكلمة المرور).\r\n\r\n4. تعديل الشروط\r\n\r\nنحتفظ بالحق في تعديل هذه الشروط في أي وقت. سيتم إشعار المستخدمين بأي تعديلات هامة على هذه الشروط.\r\n\r\n\r\n--------------------------------------------------------------------------\r\nمن خلال استخدامك لنظام Eduda، فإنك تؤكد أنك قرأت وفهمت سياسة الخصوصية وشروط الاستخدام، وأنك توافق على الالتزام بها.\r\n");
        }

        private void label3_Click(object sender, EventArgs e)
        {
            this.Close();
        }
    }
}
